In [1]:
import pandas as pd

In [3]:
df = pd.read_csv('user.txt',sep='|')

In [4]:
df.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [5]:
df.set_index('user_id',inplace=True)

In [6]:
df.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

### what is the mean age per occupation

In [7]:
df.groupby('occupation').age.mean()

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
entertainment    29.222222
executive        38.718750
healthcare       41.562500
homemaker        32.571429
lawyer           36.750000
librarian        40.000000
marketing        37.615385
none             26.555556
other            34.523810
programmer       33.121212
retired          63.071429
salesman         35.666667
scientist        35.548387
student          22.081633
technician       33.148148
writer           36.311111
Name: age, dtype: float64

### find the Male ratio per occupation and sort it from the most to the
least

In [8]:
##for ex

df[df.occupation=='programmer'].gender.value_counts()

M    60
F     6
Name: gender, dtype: int64

In [9]:
60/66.0

0.9090909090909091

In [11]:
def male_ratio(x):
    total=df[df.occupation==x].gender.value_counts().sum()
    count_male = df[df.occupation==x].gender[df.gender=='M'].count()
    ratio = (count_male/float(total))*100
    return ratio

In [12]:
s=pd.Series()

In [13]:
for i in df.occupation.unique():
    s[i]=male_ratio(i)

In [12]:
s.sort_values(ascending=False)

doctor           100.000000
engineer          97.014925
technician        96.296296
retired           92.857143
programmer        90.909091
executive         90.625000
scientist         90.322581
entertainment     88.888889
lawyer            83.333333
salesman          75.000000
educator          72.631579
student           69.387755
other             65.714286
marketing         61.538462
writer            57.777778
none              55.555556
administrator     54.430380
artist            53.571429
librarian         43.137255
healthcare        31.250000
homemaker         14.285714
dtype: float64

### For each occupation, calculate the minimum and maximum age

In [16]:
df.groupby('occupation').age.agg(['min','max'])

               min  max
occupation
administrator   21   70
artist          19   48
doctor          28   64
educator        23   63
engineer        22   70
entertainment   15   50
executive       22   69
healthcare      22   62
homemaker       20   50
lawyer          21   53
librarian       23   69
marketing       24   55
none            11   55
other           13   64
programmer      20   63
retired         51   73
salesman        18   66
scientist       23   55
student          7   42
technician      21   55
writer          18   60

### For each combination of occupation and gender, calculate the mean age

In [17]:
df.groupby(['occupation','gender']).age.agg('mean')

occupation     gender
administrator  F         40.638889
               M         37.162791
artist         F         30.307692
               M         32.333333
doctor         M         43.571429
educator       F         39.115385
               M         43.101449
engineer       F         29.500000
               M         36.600000
entertainment  F         31.000000
               M         29.000000
executive      F         44.000000
               M         38.172414
healthcare     F         39.818182
               M         45.400000
homemaker      F         34.166667
               M         23.000000
lawyer         F         39.500000
               M         36.200000
librarian      F         40.000000
               M         40.000000
marketing      F         37.200000
               M         37.875000
none           F         36.500000
               M         18.600000
other          F         35.472222
               M         34.028986
programmer     F         32.166667
               M         33.216667
retired        F         70.000000
               M         62.538462
salesman       F         27.000000
               M         38.555556
scientist      F         28.333333
               M         36.321429
student        F         20.750000
               M         22.669118
technician     F         38.000000
               M         32.961538
writer         F         37.631579
               M         35.346154
Name: age, dtype: float64

###  Find the percentage of male and female in each occupation

In [18]:
new_df = pd.DataFrame(data=None)

In [19]:

def ratio(x):
    
    
    total=df[df.occupation==x].gender.value_counts().sum()
    count_male = df[df.occupation==x].gender[df.gender=='M'].count()
    count_female = df[df.occupation==x].gender[df.gender=='F'].count()
    m_ratio = (count_male/float(total))*100
    f_ratio = (count_female/float(total))*100
    
    return {'O':x,'M':m_ratio,'F':f_ratio}

In [20]:
for x in df.occupation.unique():
    f=ratio(x)
    new_df = new_df.append(f,ignore_index=True)

In [21]:
new_df

            F           M              O
0    3.703704   96.296296     technician
1   34.285714   65.714286          other
2   42.222222   57.777778         writer
3    9.375000   90.625000      executive
4   45.569620   54.430380  administrator
5   30.612245   69.387755        student
6   16.666667   83.333333         lawyer
7   27.368421   72.631579       educator
8    9.677419   90.322581      scientist
9   11.111111   88.888889  entertainment
10   9.090909   90.909091     programmer
11  56.862745   43.137255      librarian
12  85.714286   14.285714      homemaker
13  46.428571   53.571429         artist
14   2.985075   97.014925       engineer
15  38.461538   61.538462      marketing
16  44.444444   55.555556           none
17  68.750000   31.250000     healthcare
18   7.142857   92.857143        retired
19  25.000000   75.000000       salesman
20   0.000000  100.000000         doctor

In [ ]:
df.isnull()